app/controllers/customer_info_tasks_controller.rb

    task = CustomerInfoTask.find(params[:task_id])
---
SELECT `customer_info_tasks`.* FROM `customer_info_tasks` WHERE `customer_info_tasks`.`id` = 4 LIMIT 1

    task = CustomerInfoTask.find(params[:task_id])
---
SELECT `customer_info_tasks`.* FROM `customer_info_tasks` WHERE `customer_info_tasks`.`id` = 4 LIMIT 1

    task = CustomerInfoTask.find(params[:task_id])
---
SELECT `customer_info_tasks`.* FROM `customer_info_tasks` WHERE `customer_info_tasks`.`id` = 4 LIMIT 1

  def create_instance
    check_role_exist("sales_man_key")
    @rolesuser= RolesUser.where(:role_id=>@role.id,:username=>params[:username])
---
SELECT `roles_users`.* FROM `roles_users` WHERE `roles_users`.`username` = 'jason' LIMIT 1