app/controllers/roles_controller.rb

  def index
    @roles = Role.all
---
SELECT `roles`.* FROM `roles`

  def set_max_service
    @role = Role.find_by_role_code("customer_service")
    @users = RolesUser.where(:role_id=>@role.id,:username=>params[:username])
    if @users.blank?
        render :json => {"errors"=>"username is not exist"}
        return
    else
        @users.first.max_service = params[:max_service]
        @users.first.save
---
SELECT `roles_users`.* FROM `roles_users` WHERE `roles_users`.`role_id` = 1
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` = 1 LIMIT 1
SELECT `ofUser`.* FROM `ofUser`
UPDATE `roles` SET `name` = '财务部1', `updated_at` = '2014-09-11 09:11:30' WHERE `roles`.`id` = 1