app/controllers/roles_users_controller.rb

INSERT INTO `roles_users` (`role_id`, `username`) VALUES (1, 'admin')
---
  def create
    @rusers = RolesUser.new
    @rusers.role_id = params[:roles_user][:role_id]
    @rusers.username = params[:roles_user][:username]
    respond_to do |format|
      if @rusers.save